{
    "Architecure & Urban Design": [
      {
        "type": "Architecture & Urban Design",
        "description": "Thinking through spatial living systems is at the core of my design philosophy. I was raised in a family where both of my parents worked in architecture and interior design. From an early age, I was taught to consider spatial solutions for social impact. Being able to strike a balance between logic and creativity has always been central to my practice."
      }
    ],

    "Illustration & Storytelling": [
        {
          "type": "Illustration & Storytelling",
          "description": "The world is a fusion of humanity's residue that are beyond words, and visuals have become the most effective means of conveying the intangible aspects of our existence."
        }
      ],

    "Web Tool Development": [
        {
          "type": "Web Tool Development",
          "description": "Digital methods enable more efficient information processing and reach a broader audience. I believe in using pure logic to accomplish tasks, sidestepping the complexities of the physical world. When we share information on the internet while keeping the bigger picture in mind, remarkable impossibles become possible"
        }
      ],
    
      "Animation & VFX": [
        {
          "type": "Animation & VFX",
          "description": "The world is a fusion of humanity's residue that are beyond words, and visuals have become the most effective means of conveying the intangible aspects of our existence."
        }
      ],

      "Sculpture": [
        {
          "type": "Sculpture",
          "description": "Whenever I have questions about life, I know it's time to start my research. I've pursued numerous passion and side projects throughout my life, especially during transitional periods like graduating from middle school, high school, and college.At every stage of a project, my thinking is driven by research. It helps me concise down my questions and expand my answers. I voyage in all forms of media and gather all relevant information, examine the relationships between data points to uncover new insights, and then analyze the emerging patterns or scenarios"
        }
      ],

      "Research": [
        {
          "type": "Research",
          "description": "Whenever I have questions about life, I know it's time to start my research. I've pursued numerous passion and side projects throughout my life, especially during transitional periods like graduating from middle school, high school, and college.At every stage of a project, my thinking is driven by research. It helps me concise down my questions and expand my answers. I voyage in all forms of media and gather all relevant information, examine the relationships between data points to uncover new insights, and then analyze the emerging patterns or scenarios"
        }
      ],

      "VR AR XR Design": [
        {
          "type": "VR AR XR Design",
          "description": "When spatial thinking logic, visual storytelling, with technological functioning products comes along - it is XR design"
        }
      ],

      "Game": [
        {
          "type": "Game",
          "description": "When spatial thinking logic, visual storytelling, with technological functioning products comes along - it is XR design"
        }
      ],

      "Computation": [
        {
          "type": "Computation",
          "description": "Digital methods enable more efficient information processing and reach a broader audience. I believe in using pure logic to accomplish tasks, sidestepping the complexities of the physical world. When we share information on the internet while keeping the bigger picture in mind, remarkable impossibles become possible"
        }
      ],

      "Code Sketch": [
        {
          "type": "Code Sketch",
          "description": "I believe in the power of The Nature of Code—not just as a programming framework, but as a lens through which we can understand the hidden systems that govern both organic and digital worlds. As a former student of Daniel Shiffman, I’ve learned to see code not merely as logic, but as a medium capable of simulating life itself. Through this perspective, I explore virtual ecosystems where behaviors emerge, evolve, and interact much like natural phenomena. These digital environments aren't just artificial—they reveal truths about how patterns, feedback loops, and adaptation function across all systems, physical or virtual. By studying the “nature” within code, I aim to build spaces where computation feels alive—where digital matter grows, decays, and transforms with purpose and unpredictability, mirroring the complexity of real-world ecologies."
        }
      ],
      
    "UI UX Design": [
        {
          "type": "UI UX Design",
          "description": "Digital methods enable more efficient information processing and reach a broader audience. I believe in using pure logic to accomplish tasks, sidestepping the complexities of the physical world. When we share information on the internet while keeping the bigger picture in mind, remarkable impossibles become possible"
        }
      ]

}